Repository: airtaxi/AT-Installer
Catalog: MsixInstallerComposer/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr, zh_hans, zh_hant

# SettingsPage_DescriptionTextBlock.Text
source: Application settings and information
ja_jp: アプリケーション設定と情報
ko_kr: 애플리케이션 설정 및 정보
zh_hans: 应用程序设置与信息
zh_hant: 應用程式設定與資訊

# SettingsPage_GeneralSettingsGroup.Header
source: General
ja_jp: 全般
ko_kr: 일반
zh_hans: 常规
zh_hant: 一般

# SettingsPage_GitHubRepositoryButton.Content
source: Open GitHub
ja_jp: GitHubを開く
ko_kr: GitHub 열기
zh_hans: 打开 GitHub
zh_hant: 開啟 GitHub

# SettingsPage_GitHubRepositorySettingsCard.Description
source: View the source code — contributions and pull requests welcome
ja_jp: ソースコードを確認できます。コントリビューションと Pull Request を歓迎します
ko_kr: 소스 코드를 확인하실 수 있습니다. 기여와 Pull Request를 환영합니다
zh_hans: 可查看源代码。欢迎贡献代码和提交 Pull Request
zh_hant: 可檢視原始碼。歡迎貢獻程式碼和提交 Pull Request

# SettingsPage_GitHubRepositorySettingsCard.Header
source: GitHub Repository
ja_jp: GitHub リポジトリ
ko_kr: GitHub 리포지토리
zh_hans: GitHub 仓库
zh_hant: GitHub 儲存庫

# SettingsPage_LanguageRestartDialogMessage
source: Restart the app to apply the language change.
ja_jp: 言語変更を完全に適用するにはアプリを再起動してください。
ko_kr: 언어 변경을 완전히 적용하려면 앱을 다시 시작하세요.
zh_hans: 重启应用以应用语言更改。
zh_hant: 重新啟動應用程式以套用語言變更。

# SettingsPage_LanguageRestartDialogTitle
source: Language Change
ja_jp: 言語変更
ko_kr: 언어 변경
zh_hans: 语言更改
zh_hant: 語言變更

# SettingsPage_LanguageSettingsCard.Description
source: Select the display language for the application
ja_jp: アプリケーションの表示言語を選択
ko_kr: 애플리케이션 표시 언어를 선택하세요
zh_hans: 选择应用程序的显示语言
zh_hant: 選擇應用程式的顯示語言

# SettingsPage_LanguageSettingsCard.Header
source: Language
ja_jp: 言語
ko_kr: 언어
zh_hans: 语言
zh_hant: 語言

# SettingsPage_LightThemeComboBoxItem.Content
source: Light
ja_jp: ライト
ko_kr: 밝게
zh_hans: 浅色
zh_hant: 淺色

# SettingsPage_NoUpdateDialogMessageFormat
source: The application is up to date. (Current version: {0})
ja_jp: アプリケーションは最新です。(現在のバージョン: {0})
ko_kr: 애플리케이션이 최신 버전입니다. (현재 버전: {0})
zh_hans: 应用程序已是最新版本。（当前版本：{0}）
zh_hant: 應用程式已是最新版本。（目前版本：{0}）

# SettingsPage_NoUpdateDialogTitle
source: Up to Date
ja_jp: 最新です
ko_kr: 최신 버전
zh_hans: 已是最新版本
zh_hant: 已是最新版本

# SettingsPage_OpenStoreButtonText
source: Open Store
ja_jp: Store を開く
ko_kr: Store 열기
zh_hans: 打开 Store
zh_hant: 開啟 Store

# SettingsPage_SaveSettingsFailedDialogMessage
source: Failed to save settings.
ja_jp: 設定の保存に失敗しました。
ko_kr: 설정 저장에 실패했습니다.
zh_hans: 保存设置失败。
zh_hant: 儲存設定失敗。

# SettingsPage_SaveSettingsFailedDialogTitle
source: Save Failed
ja_jp: 保存失敗
ko_kr: 저장 실패
zh_hans: 保存失败
zh_hant: 儲存失敗

# SettingsPage_SystemDefaultLanguageComboBoxItem.Content
source: System Default
ja_jp: システム既定
ko_kr: 시스템 기본
zh_hans: 系统默认
zh_hant: 系統預設

# SettingsPage_SystemDefaultThemeComboBoxItem.Content
source: System Default
ja_jp: システム既定
ko_kr: 시스템 기본
zh_hans: 系统默认
zh_hant: 系統預設

# SettingsPage_ThemeSettingsCard.Description
source: Select the application theme
ja_jp: アプリケーションのテーマを選択
ko_kr: 애플리케이션 테마를 선택하세요
zh_hans: 选择应用程序主题
zh_hant: 選擇應用程式佈景主題

# SettingsPage_ThemeSettingsCard.Header
source: Theme
ja_jp: テーマ
ko_kr: 테마
zh_hans: 主题
zh_hant: 佈景主題

# SettingsPage_TitleTextBlock.Text
source: Settings
ja_jp: 設定
ko_kr: 설정
zh_hans: 设置
zh_hant: 設定

# SettingsPage_UpdateAvailableDialogMessageFormat
source: {0} update(s) are available. (Current version: {1})
ja_jp: {0} 個の更新があります。(現在のバージョン: {1})
ko_kr: {0}개의 업데이트가 있습니다. (현재 버전: {1})
zh_hans: 有 {0} 个可用更新。（当前版本：{1}）
zh_hant: 有 {0} 個可用更新。（目前版本：{1}）

# SettingsPage_UpdateAvailableDialogTitle
source: Update Available
ja_jp: 更新あり
ko_kr: 업데이트 가능
zh_hans: 有可用更新
zh_hant: 有可用更新

# SettingsPage_UpdateCheckFailedDialogMessage
source: An error occurred while checking for updates.
ja_jp: 更新の確認中にエラーが発生しました。
ko_kr: 업데이트를 확인하는 중 오류가 발생했습니다.
zh_hans: 检查更新时发生错误。
zh_hant: 檢查更新時發生錯誤。

# SettingsPage_UpdateCheckFailedDialogTitle
source: Update Check Failed
ja_jp: 更新チェック失敗
ko_kr: 업데이트 확인 실패
zh_hans: 检查更新失败
zh_hant: 檢查更新失敗

# SettingsPage_UpdateCheckSettingsCard.Description
source: Check for updates from the Microsoft Store
ja_jp: Microsoft Store から更新を確認
ko_kr: Microsoft Store에서 업데이트를 확인하세요
zh_hans: 从 Microsoft Store 检查更新
zh_hant: 從 Microsoft Store 檢查更新

# SettingsPage_UpdateCheckSettingsCard.Header
source: Check for Updates
ja_jp: 更新チェック
ko_kr: 업데이트 확인
zh_hans: 检查更新
zh_hant: 檢查更新

# SettingsPage_UpdateSettingsGroup.Header
source: Update
ja_jp: 更新
ko_kr: 업데이트
zh_hans: 更新
zh_hant: 更新

# SettingsPage_VersionSettingsCard.Description
source: Application version
ja_jp: アプリケーションバージョン
ko_kr: 애플리케이션 버전
zh_hans: 应用程序版本
zh_hant: 應用程式版本

# SettingsPage_VersionSettingsCard.Header
source: Version
ja_jp: バージョン
ko_kr: 버전
zh_hans: 版本
zh_hant: 版本

# SettingsSelectorBarItem.Text
source: Settings
ja_jp: 設定
ko_kr: 설정
zh_hans: 设置
zh_hant: 設定

# UpdateAvailableDialogMessageFormat
source: {0} update(s) are available. (Current version: {1})
ja_jp: {0} 個の更新があります。(現在のバージョン: {1})
ko_kr: {0}개의 업데이트가 있습니다. (현재 버전: {1})
zh_hans: 有 {0} 个可用更新。（当前版本：{1}）
zh_hant: 有 {0} 個可用更新。（目前版本：{1}）

# UpdateAvailableDialogTitle
source: Update Available
ja_jp: 更新あり
ko_kr: 업데이트 가능
zh_hans: 有可用更新
zh_hant: 有可用更新

# UpdateCheckFailedDialogMessage
source: An error occurred while checking for updates.
ja_jp: 更新の確認中にエラーが発生しました。
ko_kr: 업데이트를 확인하는 중 오류가 발생했습니다.
zh_hans: 检查更新时发生错误。
zh_hant: 檢查更新時發生錯誤。

# UpdateCheckFailedDialogTitle
source: Update Check Failed
ja_jp: 更新チェック失敗
ko_kr: 업데이트 확인 실패
zh_hans: 检查更新失败
zh_hant: 檢查更新失敗

# ValidDaysTextBox.PlaceholderText
source: Enter number of days
ja_jp: 日数を入力
ko_kr: 일수를 입력하세요
zh_hans: 输入天数
zh_hant: 輸入天數

# WinAppService_CheckingBinaryMessage
source: Checking winapp CLI binaries...
ja_jp: winapp CLI バイナリを確認しています...
ko_kr: winapp CLI 바이너리를 확인하는 중...
zh_hans: 正在检查 winapp CLI 二进制文件...
zh_hant: 正在檢查 winapp CLI 二進位檔案...

# WinAppService_DownloadingMessageFormat
source: Downloading winapp CLI binaries... {0}%
ja_jp: winapp CLI バイナリをダウンロードしています... {0}%
ko_kr: winapp CLI 바이너리를 다운로드하는 중... {0}%
zh_hans: 正在下载 winapp CLI 二进制文件... {0}%
zh_hant: 正在下載 winapp CLI 二進位檔案... {0}%

# WinAppService_ExtractingMessage
source: Extracting winapp CLI binaries...
ja_jp: winapp CLI バイナリを展開しています...
ko_kr: winapp CLI 바이너리를 압축 해제하는 중...
zh_hans: 正在解压 winapp CLI 二进制文件...
zh_hant: 正在解壓縮 winapp CLI 二進位檔案...

# WinAppService_UnsupportedArchitectureMessage
source: 32-bit (x86) systems are not supported.
ja_jp: 32ビット(x86)システムはサポートされていません。
ko_kr: 32비트(x86) 시스템은 지원되지 않습니다.
zh_hans: 不支持 32 位(x86)系统。
zh_hant: 不支援 32 位元(x86)系統。

# WindowTitle.Title
source: MSIX Installer Generator
ja_jp: MSIX インストーラー生成ツール
ko_kr: MSIX 인스톨러 생성기
zh_hans: MSIX 安装程序生成器
zh_hant: MSIX 安裝程式產生器

# ManifestPage_LogoLoadedInfoMessage
source: A logo image was loaded from the config file. The file path is not stored — only the image data is embedded. To change the image, load a new one.
ja_jp: 設定ファイルからロゴ画像が読み込まれました。ファイルパスは保存されず、画像データのみが含まれます。画像を変更するには、新しいファイルを読み込んでください。
zh_hans: 已从配置文件加载徽标图像。文件路径不会被保存，只有图像数据被嵌入。要更改图像，请加载新文件。
zh_hant: 已從設定檔案載入標誌影像。檔案路徑不會被儲存，只有影像資料被嵌入。要變更影像，請載入新檔案。
